/*
 公司目的：
 - 帮助求职者打造、运营个人职业机会！

 问题
 - 描述客户的“切肤之痛”
   1，服务
 - 简介目前客户是如何应对这些问题的

 解决方案
 - 阐述公司的产品/服务的价值定位如何解决客户的难题
 - 说明公司的产品/服务具体在何处得到实现
 - 提供一些产品/服务使用的具体例子

 时机：为何是现在？
 - 回顾公司产品/服务所应用的领域的历史演变
 - 说明哪些近期的趋势使得公司的产品/服务之优越性得到可能

 市场规模
 - 定义你的目标客户并描绘他们的特性
 - 用不同的方法测算市场规模，比如用自上而下法估算可获取的市场规模(total addressable market)，用自下而上法统计可获取的收入规模 (sales addressable market)，或依据市场占有率份额来估计 (share of market)

 竞争格局
 - 列出现有的和潜在的竞争对手
 - 分析各自的竞争优势

 产品/服务
 - 产品/服务描述：外形，功能，性能，结构，知识产权等等
 1，基于网络多层面的展示应聘方-->招聘方浏览、筛选-->协助面试过程
 - 产品/服务的开发计划

 商业模式
 - 收入模式
 - 定价
 - 从每个客户上可获得的平均收入或其终身价值
 - 销售和渠道
 - 现有客户和正在开发的客户清单

 团队描述
 - 创始人和核心管理层
 - 董事会成员和顾问委员会成员

 财务资料
 - 利润表
 - 资产负债表
 - 现金流量表
 - 股本结构
 - 融资计划

 */