/*

 应聘方======================================

 我发起的面试---等待hr处理---hr已查看简历，等待hr帅选---|--hr同意，等待面试---|--面试通过---|--试用期通过
                                                        |--hr拒绝			 |--面试失败   |--试用期失败
                                                        
 hr发起的面试---等待我处理---我已查看职位，等待我帅选---|--我同意，等待hr确认---|--hr确认，等待面试---|--面试通过---|试用期通过
                                                        |--我拒绝			   |--hr确认失败   	 	 |--面试失败   |试用期失败

 简化



 招聘方======================================
 人才发起的面试---等待我处理---我已查看简历，等待我帅选|--我同意，通知人才面试---待面试的人|--面试通过---|试用期通过
                                                        |--我拒绝			              |--面试失败   |试用期失败

 我发起的面试---等待人才处理---人才已查看职位，等待帅选---|--人才同意，我查看联系方式，邀请人才面试---|--面试通过---|--试用期通过
                                                            |--人才拒绝			                         |--面试失败   |--试用期失败


 =================================想法====================================
 1，精简面试：有签约金的就进行面试跟踪，没有签约金的就不进行面试全程跟踪

 */