app/controllers/accounts/registrations_controller.rb

INSERT INTO `accounts` (`created_at`, `current_sign_in_at`, `current_sign_in_ip`, `email`, `encrypted_password`, `last_sign_in_at`, `last_sign_in_ip`, `sign_in_count`) VALUES ('2014-05-25 17:40:26', '2014-05-25 17:40:26', '127.0.0.1', '99866770@qq.com', '$2a$10$Xr9/BRHGxlxPQQVrSfuuDOUJGqXe8UmIELmcU.jhHt9ROC7f531ya', '2014-05-25 17:40:26', '127.0.0.1', 1)
SELECT COUNT(*) FROM `accounts`
SELECT `accounts`.* FROM `accounts` ORDER BY `accounts`.`id` DESC LIMIT 1
---
  def ajax_create
    result = {status: "ok"}
    begin
      unless captcha_valid? params[:captcha]
        #验证码错误
        raise AjaxException.new({captcha: "验证码错误"})
      end
      binding.pry
      resource = Account.new(
        email: params[:account][:email],
        password: params[:account][:password],
        account_type: params[:user_type]
      )
      unless resource.save
        #创建失败
        raise AjaxException.new(resource.errors.messages.inject({}){|hash, item| hash[item[0]] = item[1]*','; hash})
      end

      #从cookie取出首页的期望城市和职位标签存入简历
      current_account_resume = resource.current_account_resume
      current_account_resume.hope_area = cookies[:account_hope_area] if cookies[:account_hope_area].present?