app/controllers/accounts/sessions_controller.rb

  def create
    super
    #从cookie取出首页关联的标签
    current_account_resume = current_account.current_account_resume
    #如果简历里没有则从cookie取，否则存入cookie
    if current_account_resume.hope_area.blank?
      current_account_resume.hope_area = cookies[:account_hope_area] if cookies[:account_hope_area].present?
      current_account_resume.tag_list.add(cookies[:account_tag_list].split(",")) if cookies[:account_tag_list].present?
      current_account_resume.save
---
UPDATE `accounts` SET `last_sign_in_at` = '2014-05-06 06:37:01', `current_sign_in_at` = '2014-05-06 06:46:50', `sign_in_count` = 3, `updated_at` = '2014-05-06 06:46:50' WHERE `accounts`.`id` = 1